package com.example.pokedex.netwrok.data

import com.google.gson.annotations.SerializedName

data class PokemonInfo(
    val stats : List<PokemonStatus>?,
    val types : List<PokemonType>?
)

data class PokemonStatus(
    @SerializedName("base_stat")
    val baseStat : Int?,
    val stat : StatusName?,
)

data class StatusName(
    val name : String?,
    val url : String?
)

data class PokemonType(
    val slot : Int?,
    val type : TypeName?
)
data class TypeName(
    val name : String?,
    val url : String?
)

data class PokemonInfoResult(
    val status : Map<String, Int>,
    val typeList : List<String>
)


fun PokemonStatus.mapper() : Pair<String, Int>? {
    baseStat ?: return null
    stat?.name ?: return null

    return Pair(getStatusKoreanName(stat.name), baseStat)
}

fun PokemonType.mapper() : String? {
    type?.name?.let {
        return it
    } ?: return null
}

fun PokemonInfo.mapper() : PokemonInfoResult {

    val status = mutableMapOf<String, Int>()
    val typeList = mutableListOf<String>()

    stats?.mapNotNull { it.mapper() }?.forEach {
        status[it.first] = it.second
    }

    types?.mapNotNull { it.mapper() } ?.let {
        typeList.addAll(it)
    }

    return PokemonInfoResult(
        status = status,
        typeList = typeList
    )
}

fun getPokemonList() = listOf(
    "이상해씨", "이상해풀", "이상해꽃",
    "파이리", "리자드", "리자몽",
    "꼬부기", "어니부기", "거북왕",
    "캐터피", "단데기", "버터플",
    "뿔충이", "딱충이", "독침붕",
    "구구", "피죤", "피죤투",
    "꼬렛", "레트라",
    "깨비참", "깨비드릴조",
    "아보", "아보크",
    "피카츄", "라이츄",
    "모래두지", "고지",
    "니드런♀", "니드리나", "니드퀸",
    "니드런♂", "니드리노", "니드킹",
    "삐삐", "픽시",
    "식스테일", "나인테일",
    "푸린", "푸크린",
    "주뱃", "골뱃",
    "뚜벅초", "냄새꼬", "라플레시아",
    "파라스", "파라섹트",
    "콘팡", "도나리",
    "디그다", "닥트리오",
    "나옹", "페르시온",
    "고라파덕", "골덕",
    "망키", "성원숭",
    "가디", "윈디",
    "발챙이", "수륙챙이", "강챙이",
    "캐이시", "윤겔라", "후딘",
    "알통몬", "근육몬", "괴력몬",
    "모다피", "우츠동", "우츠보트",
    "왕눈해", "독파리",
    "꼬마돌", "데구리", "딱구리",
    "포니타", "날쌩마",
    "야돈", "야도란",
    "코일", "레어코일",
    "파오리",
    "두두", "두투리오",
    "쥬쥬", "쥬레곤",
    "질퍽이", "찔뻐기",
    "셀러", "파르셀",
    "고오스", "고우스트", "팬텀",
    "롱스톤",
    "슬리프", "슬리퍼",
    "크랩", "킹크랩",
    "찌리리공", "붐볼",
    "아라리", "나시",
    "탕구리", "텅구리",
    "시라소몬", "홍수몬",
    "내루미",
    "또가스", "또도가스",
    "뿔카노", "코뿌리",
    "럭키",
    "덩쿠리",
    "캥카",
    "쏘드라", "시드라",
    "콘치", "왕콘치",
    "별가사리", "아쿠스타",
    "마임맨",
    "스라크",
    "루주라",
    "에레브",
    "마그마",
    "쁘사이저",
    "켄타로스",
    "잉어킹",
    "갸라도스",
    "라프라스",
    "메타몽",
    "이브이", "샤미드", "쥬피선더", "부스터",
    "폴리곤",
    "암나이트", "암스타",
    "투구", "투구푸스",
    "프테라",
    "잠만보",
    "프리져", "썬더", "파이어",
    "미뇽", "신뇽", "망나뇽",
    "뮤츠", "뮤",
    "치코리타", "베이리프", "메가니움",
    "브케인", "마그케인", "블레이범",
    "리아코", "엘리게이", "장크로다일",
    "꼬리선", "다꼬리",
    "부우부", "야부엉",
    "레디바", "레디안",
    "페이검", "아리아도스",
    "크로뱃",
    "초락", "랜턴",
    "피츄",
    "삐",
    "푸푸린",
    "토게피", "토게틱",
    "네이티", "네이티오",
    "메리프", "보송송", "전룡",
    "아르코", "마릴", "마릴리",
    "꼬지지",
    "왕구리",
    "통통코", "두코", "솜솜코",
    "에이팜",
    "해터츠", "해루미",
    "왕자리",
    "우파", "누오",
    "에브이", "블래키",
    "니로우",
    "야도킹",
    "무우마",
    "안농",
    "마자용",
    "키링키",
    "피콘", "쏘콘",
    "노고치",
    "글라이거",
    "강철톤",
    "블루", "그랑블루",
    "침바루",
    "핫삼",
    "단단지",
    "헤라크로스",
    "포푸니",
    "깜지곰", "링곰",
    "마그마그", "마그카르고",
    "꾸꾸리", "메꾸리",
    "코산호",
    "총어", "대포무노",
    "딜리버드",
    "만타인",
    "무장조",
    "데빌", "헬가",
    "킹드라",
    "코코리", "코리갑",
    "폴리곤2",
    "노라키",
    "루브도",
    "배루키", "키포에라",
    "뽀뽀라", "에레키드", "마그비",
    "밀탱크",
    "해피너스",
    "라이코", "앤테이", "스이쿤",
    "애버라스", "데기라스", "마기라스",
    "루기아", "칠색조",
    "세레비",
    "나무지기", "나무돌이", "나무킹",
    "야차모", "영치코", "번치코",
    "물짱이", "늪짱이", "대짱이",
    "포챠나", "그라에나",
    "지그제구리", "직구리",
    "개무소", "실쿤", "뷰티플라이", "카스쿤", "독케일",
    "연꽃몬", "로토스", "로파파",
    "도토링", "잎새코", "다탱구",
    "테일로", "스왈로",
    "갈모매", "페리퍼",
    "랄토스", "킬리아", "가디안",
    "비구술", "비나방",
    "버섯꼬", "버섯모",
    "게을로", "발바로", "게을킹",
    "토중몬", "아이스크", "껍질몬",
    "소곤룡", "노곤룡", "폭음룡",
    "마그탕", "하리뭉",
    "루리리",
    "코코파스",
    "에나비", "델케티",
    "깜까미",
    "입치트",
    "가보리", "갱도라", "보스로라",
    "요가랑", "요가램",
    "썬더라이", "썬더볼트",
    "플러시", "마이농",
    "볼비트", "네오비트",
    "로젤리아",
    "꼴깍몬", "꿀꺽몬",
    "샤프니아", "샤크니아",
    "고래왕자", "고래왕",
    "둔타", "폭타",
    "코터스",
    "피그점프", "피그킹",
    "얼루기",
    "톱치", "비브라바", "플라이곤",
    "선인왕", "밤선인",
    "파비코", "파비코리",
    "쟝고", "세비퍼",
    "루나톤", "솔록",
    "미꾸리", "메깅",
    "가재군", "가재장군",
    "오똑군", "점토도리",
    "릴링", "릴리요",
    "아노딥스", "아말도",
    "빈티나", "밀로틱",
    "캐스퐁", "켈리몬",
    "어둠대신", "다크펫",
    "해골몽", "미라몽",
    "트로피우스",
    "치렁",
    "앱솔",
    "마자",
    "눈꼬마", "얼음귀신",
    "데굴레오", "씨레오", "씨카이저",
    "진주몽", "헌테일", "분홍장이",
    "시라칸",
    "사랑동이",
    "아공이", "쉘곤", "보만다",
    "메탕", "메탕구", "메타그로스",
    "레지락", "레지아이스", "레지스틸",
    "라티아스", "라티오스",
    "가이오가", "그란돈", "레쿠쟈",
    "지라치", "테오키스"
)